web-rails/app/views/teams/_form.html.erb

SELECT "universities".* FROM "universities" ORDER BY "universities"."name" ASC
---
    <%= form.label :university_id, 'University', style: "display: block" %>
    <%= form.collection_select :university_id, University.order(:name), :id, :name, include_blank: true %>

SELECT "team_memberships".* FROM "team_memberships" WHERE "team_memberships"."team_id" = 1 AND "team_memberships"."status" = 'approved'
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 3)
---
      <%= form.label :captain_id, 'Captain', style: "display: block" %>
      <% members = team.team_memberships.includes(:user).where(status: 'approved').map(&:user) %>