web-rails/app/views/teams/show.html.erb

SELECT "team_memberships".* FROM "team_memberships" WHERE "team_memberships"."team_id" = 1
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 3)
---
<div>
  <% memberships = @team.team_memberships.includes(:user) %>

SELECT "team_memberships".* FROM "team_memberships" WHERE "team_memberships"."team_id" = 1
---
  <% if user_signed_in? && (current_user.role == 'admin' || can_manage_team?(@team)) %>
    <% @team.team_memberships.each do |m| %>

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT "team_memberships".* FROM "team_memberships" WHERE "team_memberships"."team_id" = 1
---
  <% if user_signed_in? %>
    <% existing = @team.team_memberships.find { |tm| tm.user_id == current_user.id } %>