web-rails/app/views/team_memberships/_form.html.erb

    <%= form.label :team_id, style: "display: block" %>
    <%= form.collection_select :team_id, Team.all, :id, :name, include_blank: false %>
---
SELECT "teams".* FROM "teams"

    <%= form.label :user_id, style: "display: block" %>
    <%= form.collection_select :user_id, User.all, :id, :display_name, include_blank: false %>
---
SELECT "users".* FROM "users"