web-rails/app/views/users/_user.html.erb

    <% else %>
      <% initial = user.user_name.to_s.first&.upcase || '?' %>
---
SELECT "users".* FROM "users"