web-rails/app/views/users/index.html.erb

        <% else %>
          <% initial = user.user_name.to_s.first&.upcase || '?' %>
---
SELECT "users".* FROM "users"