web-rails/app/views/results/index.html.erb

      </h2>
      <% results = game.results.includes(:team).sort_by { |r| -r.score.to_i } %>
---
SELECT "results".* FROM "results" WHERE "results"."game_id" = 1
SELECT "teams".* FROM "teams" WHERE "teams"."id" IN (1, 2)