web-rails/app/controllers/application_controller.rb

  def current_user
    return @current_user if defined?(@current_user)
    @current_user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1

  def can_manage_team?(team)
    return true if user_signed_in? && current_user.role == 'admin'
    return false unless user_signed_in?
    membership = TeamMembership.find_by(team_id: team.id, user_id: current_user.id, status: TeamMembership::STATUS_APPROVED)
---
SELECT "team_memberships".* FROM "team_memberships" WHERE "team_memberships"."team_id" = 1 AND "team_memberships"."user_id" = 4 AND "team_memberships"."status" = 'approved' LIMIT 1