web-rails/app/controllers/games_controller.rb

SELECT 1 AS one FROM "results" WHERE "results"."game_id" = 1 LIMIT 1
SELECT "teams".* FROM "teams" WHERE "teams"."id" = 1
---
  def show
    if @game.final_results.exists?
      @final = true
      @results = @game.final_results.includes(:team).order(position: :asc, score: :desc)
    else
      @final = false
      @results = @game.results.includes(:team).order(score: :desc)
    end
    @writeups = @game.writeups.includes(:team).order(created_at: :desc)
    if user_signed_in?
      # команды пользователя, которыми он может управлять
      my_team_ids = TeamMembership.where(user_id: current_user.id, status: TeamMembership::STATUS_APPROVED).pluck(:team_id)
      @my_manageable_teams = Team.where(id: my_team_ids).select { |t| can_manage_team?(t) }