web-rails/app/controllers/games_controller.rb

  def index
    @ongoing_games  = Game.ongoing.order(ends_at: :asc)
    @upcoming_games = Game.upcoming.order(starts_at: :asc)
---
SELECT "games".* FROM "games" WHERE (starts_at <= '2025-08-20 22:55:08.950084' AND ends_at >= '2025-08-20 22:55:08.950095') ORDER BY "games"."ends_at" ASC
SELECT "games".* FROM "games" WHERE (starts_at > '2025-08-20 22:56:44.790790') ORDER BY "games"."starts_at" ASC

  def show
    @results = @game.results.includes(:team).order(score: :desc)
---
SELECT "results".* FROM "results" WHERE "results"."game_id" = 1 ORDER BY "results"."score" DESC
SELECT "teams".* FROM "teams" WHERE "teams"."id" IN (1, 2)

  def create
    @game = Game.new(game_params)

    if @game.save
---
INSERT INTO "games" ("name", "organizer", "starts_at", "ends_at", "created_at", "updated_at") VALUES ('VolgeCTF', 'vctf', '2026-02-20 00:00:00', '2026-02-21 00:00:00', '2025-08-20 22:56:40.874143', '2025-08-20 22:56:40.874143') RETURNING "id"

  def update
    if @game.update(game_params)
---
UPDATE "games" SET "starts_at" = '2024-08-01 22:22:00', "ends_at" = '2024-08-24 22:22:00', "updated_at" = '2025-08-20 22:55:55.127379' WHERE "games"."id" = 2

    def set_game
      @game = Game.find(params.expect(:id))
---
SELECT "games".* FROM "games" WHERE "games"."id" = 1 LIMIT 1