web-rails/app/controllers/profiles_controller.rb

SELECT "team_memberships".* FROM "team_memberships" WHERE "team_memberships"."user_id" = 4 ORDER BY "team_memberships"."created_at" DESC
SELECT "teams".* FROM "teams" WHERE "teams"."id" IN (3, 1)
---
  def show
    @user = current_user
    @memberships = @user.team_memberships.includes(:team).order(created_at: :desc)

UPDATE "users" SET "avatar_url" = 'q', "password_digest" = '$2a$12$2YX9QcMhgw6AyykChb0r9.zuO3OtlR/.QQv.aT9UT7RAyRWKOrm5i', "updated_at" = '2025-08-20 21:58:14.882101' WHERE "users"."id" = 4
---
  def update
    @user = current_user
    if @user.update(profile_params)