web-rails/app/controllers/results_controller.rb

  def index
    @games = Game.includes(results: :team).order(starts_at: :desc, created_at: :desc)
---
SELECT "games".* FROM "games" ORDER BY "games"."starts_at" DESC, "games"."created_at" DESC
SELECT "teams".* FROM "teams" WHERE "teams"."id" IN (1, 2)

  def new
    @result = Result.new
    if params[:game_id].present?
      @result.game_id = params[:game_id]
      taken_team_ids = Result.where(game_id: @result.game_id).select(:team_id)
      @available_teams = Team.where.not(id: taken_team_ids).order(:name)
---
SELECT "teams".* FROM "teams" ORDER BY "teams"."name" ASC

  def create
    @result = Result.new(result_params)

    if @result.save
---
INSERT INTO "results" ("game_id", "team_id", "score", "created_at", "updated_at") VALUES (2, 1, 123, '2025-08-20 22:20:34.943538', '2025-08-20 22:20:34.943538') RETURNING "id"

  def update
    if @result.update(result_params)
---
UPDATE "results" SET "team_id" = 2, "score" = 1, "updated_at" = '2025-08-20 22:23:06.580130' WHERE "results"."id" = 1

  def destroy
    @result.destroy!
---
DELETE FROM "results" WHERE "results"."id" = 2

    def set_result
      @result = Result.find(params.expect(:id))
---
SELECT "results".* FROM "results" WHERE "results"."id" = 3 LIMIT 1