web-rails/app/controllers/scoreboards_controller.rb

  def index
    @games = Game.includes(results: :team).order(starts_at: :desc, created_at: :desc)
---
SELECT "games".* FROM "games" ORDER BY "games"."starts_at" DESC, "games"."created_at" DESC
SELECT "teams".* FROM "teams" WHERE "teams"."id" IN (1, 2)