web-rails/app/controllers/services_controller.rb

SELECT "services".* FROM "services" WHERE "services"."public" = TRUE ORDER BY "services"."name" ASC
---
  def index
    @services = if current_user&.role == 'admin'
      Service.order(public: :desc, name: :asc)

INSERT INTO "services" ("name", "public_description", "private_description", "author", "copyright", "avatar_url", "public", "created_at", "updated_at") VALUES ('wecwe', 'wec', 'cwe', 'wec', 'wc', 'wc', FALSE, '2025-08-20 21:30:47.653822', '2025-08-20 21:30:47.653822') RETURNING "id"
---
  def create
    @service = Service.new(service_params)

    if @service.save

UPDATE "services" SET "public" = FALSE, "updated_at" = '2025-08-20 22:14:02.164852' WHERE "services"."id" = 2
---
  def toggle_public
    @service.update(public: !@service.public)

SELECT "services".* FROM "services" WHERE "services"."id" = 2 LIMIT 1
---
    def set_service
      @service = Service.find(params.expect(:id))