web-rails/app/controllers/teams_controller.rb

INSERT INTO "team_memberships" ("team_id", "user_id", "role", "status", "created_at", "updated_at") VALUES (1, 4, 'player', 'pending', '2025-08-20 21:53:33.513597', '2025-08-20 21:53:33.513597') RETURNING "id"
---
  def join_request
    return redirect_to new_session_path, alert: 'Требуется авторизация' unless user_signed_in?

    membership = TeamMembership.find_by(team_id: @team.id, user_id: current_user.id)
    if membership&.status == 'approved'
      redirect_to @team, notice: 'Вы уже участник команды.'
    elsif membership&.status == 'pending'
      redirect_to @team, notice: 'Заявка уже подана.'
    else
      membership ||= TeamMembership.new(team_id: @team.id, user_id: current_user.id)
      membership.role = 'player'
      membership.status = 'pending'
      if membership.save

SELECT "teams".* FROM "teams" WHERE "teams"."id" = 1 LIMIT 1
---
    def set_team
      @team = Team.find(params.expect(:id))