web-rails/app/controllers/team_memberships_controller.rb

SELECT "team_memberships".* FROM "team_memberships"
---
  def index
    @team_memberships = TeamMembership.all

INSERT INTO "team_memberships" ("team_id", "user_id", "role", "status", "created_at", "updated_at") VALUES (1, 1, 'player', 'approved', '2025-08-20 21:36:54.777104', '2025-08-20 21:36:54.777104') RETURNING "id"
---
  def create
    @team_membership = TeamMembership.new(team_membership_params)

    if @team_membership.save

UPDATE "team_memberships" SET "status" = 'approved', "updated_at" = '2025-08-20 22:02:43.424305' WHERE "team_memberships"."id" = 2
DELETE FROM "team_memberships" WHERE "team_memberships"."id" = 6
---
  def destroy
    team = @team_membership.team
    # Разрешаем удалять: админу, менеджерам команды (owner/captain/vice_captain) и самому пользователю (выйти из команды)
    unless (user_signed_in? && (current_user.role == 'admin' || can_manage_team?(team) || current_user.id == @team_membership.user_id))
      return redirect_to team, alert: 'Недостаточно прав'
    end

    # Запрет удалять владельца не-админам
    if @team_membership.role == 'owner' && !(user_signed_in? && current_user.role == 'admin')
      return redirect_to team, alert: 'Нельзя удалить владельца команды'
    end

    # Если удаляем капитана — очищаем привязку у команды
    if team.captain_id == @team_membership.user_id
      team.update(captain_id: nil)
    end

    @team_membership.destroy!

UPDATE "team_memberships" SET "status" = 'rejected', "updated_at" = '2025-08-20 22:02:46.519563' WHERE "team_memberships"."id" = 3
---
  def approve
    unless can_manage_team?(@team_membership.team)
      return redirect_to @team_membership.team, alert: 'Недостаточно прав'
    end
    if @team_membership.update(status: 'approved')

UPDATE "team_memberships" SET "status" = 'rejected', "updated_at" = '2025-08-20 22:02:46.519563' WHERE "team_memberships"."id" = 3
---
  def reject
    unless can_manage_team?(@team_membership.team)
      return redirect_to @team_membership.team, alert: 'Недостаточно прав'
    end
    if @team_membership.update(status: 'rejected')

SELECT "team_memberships".* FROM "team_memberships" WHERE "team_memberships"."id" = 2 LIMIT 1
---
  def accept
    @team_membership = TeamMembership.find(params.expect(:id))

SELECT "team_memberships".* FROM "team_memberships" WHERE "team_memberships"."id" = 6 LIMIT 1
UPDATE "teams" SET "captain_id" = 4, "updated_at" = '2025-08-20 22:33:02.431237' WHERE "teams"."id" = 3
UPDATE "team_memberships" SET "role" = 'player', "updated_at" = '2025-08-20 22:33:04.441088' WHERE "team_memberships"."id" = 6
---
  def decline
    @team_membership = TeamMembership.find(params.expect(:id))
    unless user_signed_in? && current_user.id == @team_membership.user_id
      return redirect_to @team_membership.team, alert: 'Недостаточно прав'
    end
    if @team_membership.update(status: 'rejected')

SELECT "team_memberships".* FROM "team_memberships" WHERE "team_memberships"."id" = 5 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 4 LIMIT 1
SELECT "teams".* FROM "teams" WHERE "teams"."id" = 3 LIMIT 1
SELECT "team_memberships".* FROM "team_memberships" WHERE "team_memberships"."id" = 6 LIMIT 1
UPDATE "teams" SET "captain_id" = NULL, "updated_at" = '2025-08-20 22:33:07.807160' WHERE "teams"."id" = 3
UPDATE "team_memberships" SET "role" = 'captain', "updated_at" = '2025-08-20 22:33:02.433677' WHERE "team_memberships"."id" = 6
UPDATE "teams" SET "captain_id" = 1, "updated_at" = '2025-08-20 22:36:53.032700' WHERE "teams"."id" = 3
UPDATE "team_memberships" SET "role" = 'captain', "updated_at" = '2025-08-20 22:36:53.037925' WHERE "team_memberships"."id" = 5
---
  def set_role
    @team_membership = TeamMembership.find(params.expect(:id))
    team = @team_membership.team
    unless can_manage_team?(team)
      return redirect_to team, alert: 'Недостаточно прав'
    end
    new_role = params[:role].to_s
    unless TeamMembership::ROLES.include?(new_role)
      return redirect_to team, alert: 'Недопустимая роль'
    end

    ActiveRecord::Base.transaction do
      if new_role == 'captain'
        # Сбрасываем предыдущего капитана
        if team.captain_id.present? && team.captain_id != @team_membership.user_id
          prev = TeamMembership.find_by(team_id: team.id, user_id: team.captain_id)
          prev.update!(role: 'player') if prev&.role == 'captain'
        end
        team.update!(captain_id: @team_membership.user_id)
      else
        # Если снимаем капитана, чистим связь
        if team.captain_id == @team_membership.user_id
          team.update!(captain_id: nil)
        end
      end

      @team_membership.update!(role: new_role, status: 'approved')

SELECT "team_memberships".* FROM "team_memberships" WHERE "team_memberships"."id" = 5 LIMIT 1
---
    def set_team_membership
      @team_membership = TeamMembership.find(params.expect(:id))