web-rails/app/controllers/team_memberships_controller.rb

    def set_team_membership
      @team_membership = TeamMembership.find(params.expect(:id))
---
SELECT "team_memberships".* FROM "team_memberships" WHERE "team_memberships"."id" = 1 LIMIT 1