web-rails/app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams"
---
  def index
    @teams = Team.all

INSERT INTO "teams" ("name", "university", "description", "website", "avatar_url", "captain_id", "created_at", "updated_at") VALUES ('Team zero', 'TUSUR', '', '', '', NULL, '2025-08-20 22:22:49.539408', '2025-08-20 22:22:49.539408') RETURNING "id"
INSERT INTO "team_memberships" ("team_id", "user_id", "role", "status", "created_at", "updated_at") VALUES (2, 1, 'owner', 'approved', '2025-08-20 22:22:49.569069', '2025-08-20 22:22:49.569069') RETURNING "id"
SELECT "team_memberships".* FROM "team_memberships" WHERE "team_memberships"."team_id" = 2 AND "team_memberships"."user_id" = 1 LIMIT 1
---
  def create
    @team = Team.new(team_params)

    if @team.save
      if user_signed_in?
        # Назначаем создателя команды владельцем и капитаном
        @team.update(captain_id: current_user.id) unless @team.captain_id.present?
        TeamMembership.find_or_create_by!(team_id: @team.id, user_id: current_user.id) do |m|

UPDATE "teams" SET "updated_at" = '2025-08-20 22:40:20.292185', "university_id" = 2 WHERE "teams"."id" = 1
SELECT "team_memberships".* FROM "team_memberships" WHERE "team_memberships"."team_id" = 1 AND "team_memberships"."user_id" = 1 LIMIT 1
UPDATE "team_memberships" SET "role" = 'player', "updated_at" = '2025-08-20 22:06:49.097445' WHERE "team_memberships"."id" = 2
SELECT "team_memberships".* FROM "team_memberships" WHERE "team_memberships"."team_id" = 1 AND "team_memberships"."user_id" = 3 LIMIT 1
UPDATE "team_memberships" SET "role" = 'captain', "updated_at" = '2025-08-20 22:06:42.339454' WHERE "team_memberships"."id" = 2
---
  def update
    if @team.update(team_params)
      if @team.saved_change_to_captain_id?
        old_id, new_id = @team.saved_change_to_captain_id

        if old_id.present?
          prev = TeamMembership.find_by(team_id: @team.id, user_id: old_id)
          if prev && prev.role == 'captain'
            # если бывший капитан был владельцем, оставляем owner, иначе делаем player
            prev.update(role: 'player')
          end
        end

        if new_id.present?
          curr = TeamMembership.find_or_initialize_by(team_id: @team.id, user_id: new_id)
          curr.status = 'approved'
          curr.role = 'captain'
          curr.save!

SELECT "team_memberships".* FROM "team_memberships" WHERE "team_memberships"."team_id" = 3 AND "team_memberships"."user_id" = 4 LIMIT 1
INSERT INTO "team_memberships" ("team_id", "user_id", "role", "status", "created_at", "updated_at") VALUES (3, 4, 'player', 'pending', '2025-08-20 22:31:40.721844', '2025-08-20 22:31:40.721844') RETURNING "id"
---
  def join_request
    return redirect_to new_session_path, alert: 'Требуется авторизация' unless user_signed_in?

    membership = TeamMembership.find_by(team_id: @team.id, user_id: current_user.id)
    if membership&.status == 'approved'
      redirect_to @team, notice: 'Вы уже участник команды.'
    elsif membership&.status == 'pending'
      redirect_to @team, notice: 'Заявка уже подана.'
    else
      membership ||= TeamMembership.new(team_id: @team.id, user_id: current_user.id)
      membership.role = 'player'
      membership.status = 'pending'
      if membership.save

SELECT "teams".* FROM "teams" WHERE "teams"."id" = 3 LIMIT 1
---
    def set_team
      @team = Team.find(params.expect(:id))