web-rails/app/controllers/universities_controller.rb

  def index
    @universities = University.all
---
SELECT "universities".* FROM "universities"

    def set_university
      @university = University.find(params.expect(:id))
---
SELECT "universities".* FROM "universities" WHERE "universities"."id" = 1 LIMIT 1