web-rails/app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("user_name", "display_name", "role", "rating", "avatar_url", "password_digest", "created_at", "updated_at") VALUES ('hotorcelexo', 'hotor', 'player', NULL, '', '$2a$12$NLR7x29.PPGxE7NoAwhrhuwsUbB55Pl17mx13wb571eENNORUmTDi', '2025-08-20 21:45:50.916747', '2025-08-20 21:45:50.916747') RETURNING "id"

    def set_user
      @user = User.find(params.expect(:id))
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1