web-rails/app/views/services/_service.html.erb

  <div style="margin-top:8px;">
    <% if service.service_archive_url.present? %>
---
SELECT "services".* FROM "services"